clarestudio/pic32mx-template/include/pic32/iomx2port.h
/* $Id: iomx2port.h,v 1.2 2016/05/29 20:19:44 clare Exp $ */
/*
 * special function registers
 */
#ifndef __PIC32MX2XX_PORT_H
#define __PIC32MX2XX_PORT_H

/*
 * port registers
 */
#define ANSELA		__SFR__(0xBF886000)
#define ANSELACLR	__SFR__(0xBF886004)
#define ANSELASET	__SFR__(0xBF886008)
#define ANSELAINV	__SFR__(0xBF88600C)
#define TRISA		__SFR__(0xBF886010)
#define TRISACLR	__SFR__(0xBF886014)
#define TRISASET	__SFR__(0xBF886018)
#define TRISAINV	__SFR__(0xBF88601C)
#define PORTA		__SFR__(0xBF886020)
#define PORTACLR	__SFR__(0xBF886024)
#define PORTASET	__SFR__(0xBF886028)
#define PORTAINV	__SFR__(0xBF88602C)
#define LATA		__SFR__(0xBF886030)
#define LATACLR		__SFR__(0xBF886034)
#define LATASET		__SFR__(0xBF886038)
#define LATAINV		__SFR__(0xBF88603C)
#define ODCA		__SFR__(0xBF886040)
#define ODCACLR		__SFR__(0xBF886044)
#define ODCASET		__SFR__(0xBF886048)
#define ODCAINV		__SFR__(0xBF88604C)
#define CNPUA		__SFR__(0xBF886050)
#define CNPUACLR	__SFR__(0xBF886054)
#define CNPUASET	__SFR__(0xBF886058)
#define CNPUAINV	__SFR__(0xBF88605C)
#define CNPDA		__SFR__(0xBF886060)
#define CNPDACLR	__SFR__(0xBF886064)
#define CNPDASET	__SFR__(0xBF886068)
#define CNPDAINV	__SFR__(0xBF88606C)
#define CNCONA		__SFR__(0xBF886070)
#define CNCONACLR	__SFR__(0xBF886074)
#define CNCONASET	__SFR__(0xBF886078)
#define CNCONAINV	__SFR__(0xBF88607C)
#define CNENA		__SFR__(0xBF886080)
#define CNENACLR	__SFR__(0xBF886084)
#define CNENASET	__SFR__(0xBF886088)
#define CNENAINV	__SFR__(0xBF88608C)
#define CNSTATA		__SFR__(0xBF886090)
#define CNSTATACLR	__SFR__(0xBF886094)
#define CNSTATASET	__SFR__(0xBF886098)
#define CNSTATAINV	__SFR__(0xBF88609C)

#define ANSELB		__SFR__(0xBF886100)
#define ANSELBCLR	__SFR__(0xBF886104)
#define ANSELBSET	__SFR__(0xBF886108)
#define ANSELBINV	__SFR__(0xBF88610C)
#define TRISB		__SFR__(0xBF886110)
#define TRISBCLR	__SFR__(0xBF886114)
#define TRISBSET	__SFR__(0xBF886118)
#define TRISBINV	__SFR__(0xBF88611C)
#define PORTB		__SFR__(0xBF886120)
#define PORTBCLR	__SFR__(0xBF886124)
#define PORTBSET	__SFR__(0xBF886128)
#define PORTBINV	__SFR__(0xBF88612C)
#define LATB		__SFR__(0xBF886130)
#define LATBCLR		__SFR__(0xBF886134)
#define LATBSET		__SFR__(0xBF886138)
#define LATBINV		__SFR__(0xBF88613C)
#define ODCB		__SFR__(0xBF886140)
#define ODCBCLR		__SFR__(0xBF886144)
#define ODCBSET		__SFR__(0xBF886148)
#define ODCBINV		__SFR__(0xBF88614C)
#define CNPUB		__SFR__(0xBF886150)
#define CNPUBCLR	__SFR__(0xBF886154)
#define CNPUBSET	__SFR__(0xBF886158)
#define CNPUBINV	__SFR__(0xBF88615C)
#define CNPDB		__SFR__(0xBF886160)
#define CNPDBCLR	__SFR__(0xBF886164)
#define CNPDBSET	__SFR__(0xBF886168)
#define CNPDBINV	__SFR__(0xBF88616C)
#define CNCONB		__SFR__(0xBF886170)
#define CNCONBCLR	__SFR__(0xBF886174)
#define CNCONBSET	__SFR__(0xBF886178)
#define CNCONBINV	__SFR__(0xBF88617C)
#define CNENB		__SFR__(0xBF886180)
#define CNENBCLR	__SFR__(0xBF886184)
#define CNENBSET	__SFR__(0xBF886188)
#define CNENBINV	__SFR__(0xBF88618C)
#define CNSTATB		__SFR__(0xBF886190)
#define CNSTATBCLR	__SFR__(0xBF886194)
#define CNSTATBSET	__SFR__(0xBF886198)
#define CNSTATBINV	__SFR__(0xBF88619C)

#define ANSELC		__SFR__(0xBF886200)
#define ANSELCCLR	__SFR__(0xBF886204)
#define ANSELCSET	__SFR__(0xBF886208)
#define ANSELCINV	__SFR__(0xBF88620C)
#define TRISC		__SFR__(0xBF886210)
#define TRISCCLR	__SFR__(0xBF886214)
#define TRISCSET	__SFR__(0xBF886218)
#define TRISCINV	__SFR__(0xBF88621C)
#define PORTC		__SFR__(0xBF886220)
#define PORTCCLR	__SFR__(0xBF886224)
#define PORTCSET	__SFR__(0xBF886228)
#define PORTCINV	__SFR__(0xBF88622C)
#define LATC		__SFR__(0xBF886230)
#define LATCCLR		__SFR__(0xBF886234)
#define LATCSET		__SFR__(0xBF886238)
#define LATCINV		__SFR__(0xBF88623C)
#define ODCC		__SFR__(0xBF886240)
#define ODCCCLR		__SFR__(0xBF886244)
#define ODCCSET		__SFR__(0xBF886248)
#define ODCCINV		__SFR__(0xBF88624C)
#define CNPUC		__SFR__(0xBF886250)
#define CNPUCCLR	__SFR__(0xBF886254)
#define CNPUCSET	__SFR__(0xBF886258)
#define CNPUCINV	__SFR__(0xBF88625C)
#define CNPDC		__SFR__(0xBF886260)
#define CNPDCCLR	__SFR__(0xBF886264)
#define CNPDCSET	__SFR__(0xBF886268)
#define CNPDCINV	__SFR__(0xBF88626C)
#define CNCONC		__SFR__(0xBF886270)
#define CNCONCCLR	__SFR__(0xBF886274)
#define CNCONCSET	__SFR__(0xBF886278)
#define CNCONCINV	__SFR__(0xBF88627C)
#define CNENC		__SFR__(0xBF886280)
#define CNENCCLR	__SFR__(0xBF886284)
#define CNENCSET	__SFR__(0xBF886288)
#define CNENCINV	__SFR__(0xBF88628C)
#define CNSTATC		__SFR__(0xBF886290)
#define CNSTATCCLR	__SFR__(0xBF886294)
#define CNSTATCSET	__SFR__(0xBF886298)
#define CNSTATCINV	__SFR__(0xBF88629C)

#endif
